In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [3]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000]}

In [4]:
df = pd.DataFrame(dataset)

In [5]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [15]:
DepGroup = df.groupby("Departman")
DepGroup

In [14]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [11]:
bilisim = DepGroup.sum().loc["Bilişim"]

In [12]:
bilisim

Maaş    7000
Name: Bilişim, dtype: int64

In [16]:
uretim = DepGroup.sum().loc["Üretim"]

In [17]:
int(uretim)

7000

In [18]:
df.groupby("Departman").count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [19]:
df.groupby("Departman").max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [27]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [31]:
df.groupby("Departman").mean().loc["Bilişim"]["Maaş"]

3500

In [34]:
df.groupby("Departman").max()["Maaş"]

Departman
Bilişim             4000
Üretim              4500
İnsan Kaynakları    3500
Name: Maaş, dtype: int64

In [36]:
import numpy as np 
import pandas as pd

In [37]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

In [38]:
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}

In [39]:
df1 = pd.DataFrame(dataset1 ,index = [1 ,2 ,3 ,4])
df2 = pd.DataFrame(dataset2 ,index = [5 ,6 ,7, 8])

In [40]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [41]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [42]:
pd.concat([df1 ,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [44]:
pd.concat([df2,df1])

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [45]:
pd.concat([df1 ,df2] ,axis = 1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [47]:
pd.concat([df2 ,df1] ,axis = 1 )

     A    B    C    A    B    C
1  NaN  NaN  NaN   A1   B1   C1
2  NaN  NaN  NaN   A2   B2   C2
3  NaN  NaN  NaN   A3   B3   C3
4  NaN  NaN  NaN   A4   B4   C4
5   A5   B5   C5  NaN  NaN  NaN
6   A6   B6   C6  NaN  NaN  NaN
7   A7   B7   C7  NaN  NaN  NaN
8   A8   B8   C8  NaN  NaN  NaN

In [48]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "anahtar" : ["K1","K2","K3"]
}

In [67]:
df1 = pd.DataFrame(dataset1 , index = [1 ,2 ,3])

In [68]:
df

    A   B anahtar
1  A1  B1      K1
2  A2  B2      K2
3  A3  B3      K3

In [69]:
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "anahtar" : ["K1","K2","K5","K4"]
}

In [70]:
df2 = pd.DataFrame(dataset2 , index = [1 ,2 ,3 ,4])

In [71]:
df2

    X   Y anahtar
1  X1  Y1      K1
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

In [72]:
pd.merge(df1,df2,how ="inner",on = "anahtar")

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

In [75]:
pd.merge(df1 ,df2 ,how = "inner" ,on ="anahtar")

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

In [76]:
pd.join

AttributeError: module 'pandas' has no attribute 'join'

In [77]:
dataset1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","A4"],
}
dataset2 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"],
    
}

In [79]:
df1 = pd.DataFrame(dataset1 , index= [1 ,2 ,3 ,4])

In [80]:
df2 = pd.DataFrame(dataset2 ,index = [1 ,2 ,3])

In [81]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  A4

In [82]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [83]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  A4  NaN  NaN

In [84]:
df1.join(df2 , how='right')

    A   B   X   Y
1  A1  B1  X1  Y1
2  A2  B2  X2  Y2
3  A3  B3  X3  Y3

In [ ]:
df.join(df2 ,)